app/views/questions/show.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1 ORDER BY "answers"."created_at" DESC  [["question_id", 7]]
---
  <strong>Answers:</strong>
  <% if @question.answers.nil? || @question.answers.length == 0 %>

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1 ORDER BY "answers"."created_at" DESC  [["question_id", 5]]
---
    <ul>
      <% @question.answers.order(created_at: :desc).each do |answer| %>