app/controllers/answers_controller.rb

  def create
    @question = Question.find(params[:question_id])
    @answer = Answer.new(answer_params)
    @answer.user_id= @question.user_id
    @answer.question = @question
    @answer.best_answer=false
    if @answer.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "answers" ("user_id", "question_id", "detail", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"