app/controllers/questions_controller.rb

  def index
    @questions = Question.order(created_at: :desc).all
---
SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC

  def create
    @question = Question.new(question_params)
    @question.user_id=1

    if @question.save
---
INSERT INTO "questions" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @question = Question.find(params[:id])
    # binding.pry
    if @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "questions" SET "title" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["title", "What is the best way for me to run my application for free and not use AWS?"], ["updated_at", "2018-04-19 23:43:14.626383"], ["id", 6]]

  def destroy
    @question = Question.find(params[:id])
    if @question.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 6]]